---
title: 3 &mdash; Циклы и срезы
permalink: /03/
---


# На прошлом занятии
* условия
* `bool`
* логические операторы

# План этого занятия
* индексы
* циклы

# Строки: индексы

Однажды ты спросишь меня, что для меня на первом месте: ты или программирование?

Я отвечу тебе, что программирование. 

И ты уйдёшь, так и не узнав, что ты для меня на нулевом месте.

## Оператор `[]`

С помощью квадратных скобок вы можете выбрать любой символ из строки:

```python
hello = 'hello'
print(hello[0])  # напечатает "h"
print(hello[1])  # напечатает "e"
print(hello[2])  # напечатает "l"
print(hello[3])  # напечатает "l"
print(hello[4])  # напечатает "0"
```

Обратите внимание, что любой элемент строки — это тоже маленькая строка

```python
hello = 'hello'
h = hello[0]
print(type(h))  # напечатает "<class 'str'>"

if hello[0] == h:
    print('The first symbol of', hello, 'is', h)

if hello[0] == hello[0][0][0][0][0][0]:
    print('Что тут произошло?')
```

# Циклы

Для выполнения ряда однотипных действий используют циклы. Самый простой — это цикл `for`:

```python
for letter in 'hello':
    print(letter)
```

Обратите внимание на отступы, они должны быть в блоке `for`, как и в блоке `if`.

```python
for number in range(5):  # числа от нуля до 5
    print(number)
    print('End of FOR loop.')
```

Цикл `while` позволяет выполнять однотипные действия, пока выполняется условие:

```python
i=9
while i >= 5:
    print(i)
    i -= 1  # это то же самое, что i = i-1
print('Finally, i =', i)
```

Выполнение цикла можно остановить по команде:

```python
for i in range(3, 30, 3):  # от 3 до 30 с шагом 3
    print(i)
    if i > 11:
        print('i превысило 11')
        break
print('End.')
```

Или можно досрочно перейти к следующей итерации:

```python
for i in range(3, 30, 3):
    print(i)
    if i == 12:
        print('Сейчас i равно 12')
        continue
    else:
        print('А теперь i =', i)
print('End.')
```

# На чём можно потренироваться?

## Шифр Цезаря

Сделать шифровальную программу, которая берёт слово и шифрует каждую букву следующей по алфавиту. Для этого нужно сделать два набора букв и оперировать их индексами.

# Домашнее задание

Вам нужно написать программу, которая производит одно из перечисленных ниже действий, в зависимости от номера Вашего варианта:

1. Спрашивает у пользователя слово (в кириллице) и выводит на экран все чётные буквы этого слова, но только если это не буква «а» или буква «к». Например, для слова «угадайка» выведутся буквы «г», «д», «й», а последняя «а» не выведется.

2. Спрашивает у пользователя слово (в кириллице) и выводит на экран нечётные буквы этого слова, но только если это буква «о»,  буква «п» или буква «е». Например, для слова «победа» это будет только буква «п».

3. Спрашивает у пользователя слово и выводит на экран все буквы этого слова задом наперёд, пропуская буквы «з» и «я».

4. Спрашивает у пользователя число N, а затем N раз спрашивает у пользователя слово  и выводит его на экран. Если пользователь ввел слово «программирование», программа должна завершить работу.

5. Спрашивает у пользователя слово и выводит на экран все его буквы до середины (не включая среднюю букву, если число букв нечётно), а вторую половину (начиная со средней буквы, если число букв нечётно), выводит на экран задом наперёд.

6. Спрашивает у пользователя число и выводит на экран таблицу умножения на это число (т. е., например, если введено число 5, то выводятся строчки вида «1 * 5 = 5»; «2 * 5 = 10», и так далее — всего десять строчек).

7. Спрашивает у пользователя число и выводит на экран все натуральные чётные числа, которые являются степенью двойки и не превышают введённого числа.
